"""Задача 1
Надрукувати всі парні числа від 2 до n (n вводить користувач)
Вхідні дані:
10
Вихідні дані:
2 4 6 8 10"""

# n = int(input("Введіть число : "))

# for i in range(2, n + 1, 2):
#     print(i, end= ' ')

"""Задача 2
Обчислити суму чисел від n до m
Вхідні дані:
5
10
Вихідні дані:
15..."""

# n = int(input("Введіть число : "))
# m = int(input("Введіть число : "))
# sum = 0

# for i in range(n, m + 1):
#     sum += i

# print(sum)

"""Задача 3
Надрукувати таблицю множення для числа n
Вхідні дані:
3
Вихідні дані:
3 x 1 = 3
3 x 2 = 6
...
3 x 10 = 30"""

# n = int(input("Введіть число : "))

# for i in range(1, 11):
#     print(f"{n} * {i} = {n*i}")
    


"""Задача 4
Підрахувати кількість цифр у введеному числі
Вхідні дані:
12345
Вихідні дані:
5"""
# n = int(input("Введіть число : "))
# n_str = str(n)

# print(len(n_str))



"""Задача 5
Вивести n зірочок в один рядок
Вхідні дані:
7
Вихідні дані:
*******"""
# n = int(input("Введіть число : "))

# for i in range(n):
#     print("*", end="")

# print()

#Вивести всі числа від 1 до 10 крім 5, за допомогою continue.
# a = 1

# while a <= 10:
#     if a == 5:
#         a += 1
#         continue
#     print(a)
#     a += 1

#Дано рядок Hello World. Напишіть програму, яка виводить всі букви в стовпчик але окрім пробілів.
# text = "Hello World"

# for char in text:
#     if char != " ":
#         print(char)


#Користувач вводить по черзі числа, зупинити введедення коли він надішле 0
# num = int(input("Введіть число"))

# while num != 0:
#     print(num)

#Користувач вводить по черзі числа, зупинити введедення коли він надішле число менше 0.

# while True:
#     num = int(input("Введіть число"))
#     if num < 0:
#         break
#     print(num)

