"""Одноклітинна амеба ділиться навпіл кожні 3 години. Визначити скільки буде амеб через 3,6,9,12, ... , 24 години
0 - 1
3 – 2
6 – 4
…
24 - ?"""
# ameba = 1

# for hour in range(0, 25, 3):
#     print(hour, ameba)
#     ameba *= 2

"""Надрукувати таблицю відповідності між масою у фунтах і масою в кілограмах для значень n фунтів (1 фунт = 453 г) у вигляді таблиці.
Вхідні дані:
5
Вихідні дані:
1   0.453
2   0.906
3   1.359
4   1.812
5   2.265
"""
n = int(input("введіть дані : "))

for i in range(1, n + 1):
    funt = i * 0.453
    print(i, funt)
    