#Задано число, визначити чи воно входить в діапазон від 10 до 30
# a = int(input("Введіть число : "))

# if a >= 10 and a <= 30:
#     print("Yes")

#Напишіть програму, яка перевіряє, чи є число парне і додатне.
# a = int(input("Введіть число : "))

# if a > 0 and a % 2 == 0:
#     print("Число парне і додатнє")

#Напишіть програму, яка перевіряє, чи є число не парне або від’ємне.
# a = int(input("Введіть число : "))

# if a < 0 or a % 2 != 0:
#     print("Число не парне або від’ємне")

#Напишіть програму, яка перевіряє, чи є число додатним, парним та не кратним 3.
# a = int(input("Введіть число : "))

# if a >= 1 and a % 2 == 0 and a % 3 != 0:
#     print("Число додатнє, парне та не кратним 3")

#Напишіть програму, яка перевіряє, чи є число кратним 3 або 5, але не кратним обом одночасно.
# a = int(input("Введіть число: "))

# if a % 3 == 0 and a % 5 == 0:
#     print("Число кратне 3 і 5")
# elif a % 3 == 0:
#     print("Число кратне 3")
# elif a % 5 == 0:
#     print("Число кратне 5")
# else:
#     print("Число не кратне 3 і 5")


#Напишіть програму, яка перевіряє, чи є число менше за 100 і більше за 50.
# a = int(input("Введіть число: "))

# if a >= 50 and a <= 100:
#     print("Число менше за 100 і більше за 50")

#Напишіть програму, яка перевіряє, чи є число додатним і менше за 50 або від'ємним і більше за -10.
# a = int(input("Введіть число: "))

# if a > 0 and a <= 50:
#     print("додатним і менше за 50")
# elif a < 0 and a > -10:
#     print("від'ємним і більше за -10")
# else:
#     print("не в діапазоні умови задачі")

#Написати програму, яка перетворює кожне слово в рядку так, щоб воно починалося з великої літери.
# lit_v = "програма, яка перетворює кожне слово в рядку так, щоб воно починалося з великої літери"

# print(lit_v.title())

#Перевірити, чи містить рядок задану підстроку.
# line = "Перевірити, чи містить рядок задану підстроку"

# print(line.find("Перевірити"))

#Написати програму, яка приймає на вхід строку, введену з клавіатури і підраховує кількість входження в строку першої літери, з якої починається ця строка.
# text = input("Введіть текст :")

# if text:
#     first_letter = text[0]
#     count = text.count(first_letter)
#     print(f"Літера '{first_letter}' зустрічається {count} разів у рядку.")
# else:
#     print("Ви не ввели текст.")
