# користувач вводить якщо воно додатнє, то написатищо воно доданє а також перевірити чи вона більше за 10
# якщо відємне, то написати що воно відємне і чи воно менше за -10
# інашке сказати що воно нуль

# num = int(input("Введіть число : "))

# if num > 0:
#     print("Число додатнє")
#     if num > 10:
#         print("та більше 10")
# elif num < 0:
#     print("Число відємне")
#     if num < -10:
#         print("та менше -10")
# else:
#     print("Число 0")

#Напишіть програму, яка перевіряє, чи є число додатним, парним та не кратним 3.

num = int(input("Введіть число : "))

if num > 0 and num % 2 == 0 and num % 3 != 0:
    print("Ok!")
else:
    print("Not ok!")

    