"""Яблука лежать на прилавку у вигляді піраміди: 1 ряд одне яблуко, другий ряд  - два і т.д. Скільки яблук на прилавку?
Вхідні дані:
150
Вихідні дані:
11325"""
# ryadoc = int(input("Вхідні дані : "))
# sum = 0

# for i in range(1, ryadoc + 1):
#     print(i)
#     sum += i
# print(sum)

"""Напишіть програму, яка друкує цілі числа від 1 до n (1 < n ≤ 1000) з такою умовою: для чисел кратних 3 виводить *3* замість числа, для чисел кратних 5 друкує *5*, а для чисел, які кратні 3 і 5 одночасно, повідомлення буде *35*.
Вхідні дані:
16
Вихідні дані:
1
2
*3*
4
*5*
*3*
7
8
*3*
*5*
11
*3*
13
14
*35*
16
"""
# n = int(input("Вхідні дані : "))

# for num in range(1, n + 1):
#     if num % 3 == 0 and num % 5 == 0:
#         print("*35*")
#     elif num % 5 == 0:
#         print("*5*")
#     elif num % 3 == 0:
#         print("*3*")
#     else:
#         print(num)

"""Напишіть програму для обчислення виразу 1/2 + 2/3 + 3/4 + …​ + n/(n + 1) із заданим n, яке вводить користувач (n > 0).
Вхідні дані:
3
Вихідні дані:
# 1.9166666666666665"""
# n = int(input("Вхідні дані : "))
# sum = 0

# for i in range(1, n + 1):
#     znach = i/(i + 1)
#     sum += znach
# print(sum)

"""При заданому користувачем значенні цілого числа n ≥ 2 обчислити вираз 1 × 2 + 2 × 3 + …​ + (n - 1) × n.
Вхідні дані:
3
Вихідні дані:
8
"""
# n = int(input("Вхідні дані : "))
# sum = 0

# for i in range(2, n + 1):
#     if i >= 2:
#         znach = (i - 1)*i
#         sum += znach
#         print(znach)
#     else:
#         print("Число менше 2")
# print(sum)