#Створити порожній список і додайте до нього 10 різних значень.
# list = []
# list.append('1')
# list.append('12')
# list.append('13')
# list.append('14')
# list.append('1')
# list.append('16')
# list.append('1')
# list.append('1')
# list.append('1')
# list.append('1')
# print(list)
#Створіть список з 5 чисел і виведіть на екран суму цих чисел.
# list = [1, 2, 3, 4, 5]
# sum = 0

# for i in list:
#     sum += i
# print(sum)

#Створіть список з 6 різних слів і виведіть на екран останнє слово в цьому списку.
# list = ['список', 'слів', 'екран', 'суму', 'рядки', 'чисел']
# last_word = list[5]
# print(last_word)

#Створіть список з 5 чисел і замініть другий елемент на нове значення.
# list = [1, 2, 3, 4, 5]
# list[1] = 6
# print(list)
#Створіть список з 6 слів і виведіть на екран всі слова, що мають довжину більше 5 символів.
# words = ['список', 'слів', 'екран', 'суму', 'рядки', 'чисел']

# for word in words:
#     if len(word) >5:
#         print(word)