#Створити змінну, помістити туди число, вивести на екран це число.
a = 4

print(a)

#Створити змінну, попросіть користувача ввести своє ім’я, виведіть привітання.
name = input("Введіть імя : ")

print(f"Привіт!", name)

#Створити дві змінні типу string і помістити туди ім’я та прізвище. Вивести привітання, враховуючи персональні дані
name = "Яна"
last_name = "Калашнікова"

print(f"Привіт!", name + " " + last_name)

#Знайдіть результат операції:
print(10 + 10 // 2) 
print(18 / 3 ** 2)
print(14 % 4)
print(10*10+5)
print(5 ** 2 - 10)
print(20*5 // 4)
print(20 + 2 * 4)
print(25 - 10 % 5)
print(16 // 4 ** 2)
print(30 - 15*2)

#Знайдіть результат операції (True/False):
print(7 * 3 <= 25)
print(12 % 5 >= 2)
print(4 + 5 > 6)
print(10 - 2 * 3 == 4)
print(2 * 4 + 1 >= 9)
print(16 / 4 + 2 > 6)
print(3 * 4 - 5 <= 7)
print(6 / 3 + 1 < 4)
print(11 - 3 == 9 + 2)
print(5 * 3 > 14)
print((5 + 2) * 3 > 15)
print(10 - (6 + 2) == 2)
print((9 / 3) + (5 * 2) <= 20)
print((7 % 3) * (2 + 3) >= 10)
print((10 / 2) + (8 - 4) > 9)

#Напишіть програму, яка зчитує два цілих числа num1 та num2 і виводить найбільше значення з них
num1 = input("Введіть перше число: ")
num2 = input("Введіть друге число: ")

if num1 > num2:
    print(num1)
else:
    print(num2)


"""Напишіть програму, яка запитує у користувача вартість покупки і 
виводить відповідне повідомлення про знижку: 
якщо сума менше 100, знижки немає; 
якщо від 100 до 500 – знижка 10%; 
якщо більше 500 – знижка 20%."""

suma_buy = input("Введіть суму покупки: ")
suma_buy = int(suma_buy)

if suma_buy < 100:
    print("Знижка відсутня")
elif suma_buy >= 100 and suma_buy < 500:
    print("Знижка 10 %")
else:
    print("Знижка 20%")


"""Користувач вводить з клавіатури ширину та довжину прямокутника, 
якщо ширина більша за довжину, то вивести периметри прямокутника, 
якщо менша то вивести площу прямокутника """

d = int(input("Введіть довжину : "))
w = int(input("Введіть ширина : "))

if w > d:
    p = d + w
    print(f"Периментр дорівнює :", p)
else:
    s = d * w
    print(f"Площа дорівнює :", s)